20220621/Documents/РасходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>РасходнаяНакладная</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.тм_БонусныеНакопленияПолный</xr:Item>
				<xr:Item>AccumulationRegister.тм_БонусныеНакопления</xr:Item>
				<xr:Item>AccumulationRegister.тм_ПроданныеТовары</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>тм_ИспользованныеБонусы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>тм_СостояниеРасходнойНакладной</Name>
					<Type>
						<v8:Type>cfg:EnumRef.тм_СостояниеРасходнойНакладной</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>тм_Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

20220621/Enums/тм_СостояниеРасходнойНакладной.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>тм_СостояниеРасходнойНакладной</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

20220621/Documents/РасходнаяНакладная/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

&После("ПриКопировании")
Процедура тм_ПриКопировании(ОбъектКопирования)
	
	ЭтотОбъект.тм_ИспользованныеБонусы = 0;
	ЭтотОбъект.тм_СостояниеРасходнойНакладной = Перечисления.тм_СостояниеРасходнойНакладной.ВРаботе;
		
	тм_ТекущийПользователь = Пользователи.ТекущийПользователь();		
	Для каждого СтрЗапасы Из ЭтотОбъект.Запасы Цикл		
		СтрЗапасы.тм_Сотрудник = тм_КЭШ.СотрудникПользователя(тм_ТекущийПользователь);	
	КонецЦикла;  
	
КонецПроцедуры

&После("ОбработкаУдаленияПроведения")
Процедура тм_ОбработкаУдаленияПроведения(Отказ)
	
	тм_ОбщегоНазначенияВызовСервера.ОтменитьПроведенияДокументовСписанияБонусов(ЭтотОбъект.Ссылка);
	
КонецПроцедуры
 
&После("ПередЗаписью")
Процедура тм_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Права = тм_КЭШ.ПолучитьПраваОбъекта("РасходнаяНакладная", Пользователи.ТекущийПользователь());	
	
	//Если (РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения) И (Не Права.SA) Тогда
	Если Не Права.SA И Ссылка.тм_СостояниеРасходнойНакладной = Перечисления.тм_СостояниеРасходнойНакладной.Завершен Тогда
		Сообщить("Документ в статусе завершен. Изменение документа невозможно!");
		Отказ = Истина;
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура тм_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	//тм_СостояниеРасходнойНакладной = Перечисления.тм_СостояниеРасходнойНакладной.ВРаботе;	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		//И Не ДанныеЗаполнения.Свойство("ВидОперации") Тогда  // Не ДанныеЗаполнения.Свойство("ВидОперации") - исключаем заказ-наряды
		ЭтотОбъект.Ответственный = тм_КЭШ.СотрудникПользователя(Пользователи.ТекущийПользователь());
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		Для каждого СтрЗапас Из ДанныеЗаполнения.Запасы Цикл
			ИскомаяСтрока = ЭтотОбъект.Запасы.Найти(СтрЗапас.Номенклатура, "Номенклатура");
			Если ИскомаяСтрока <> Неопределено Тогда
				ИскомаяСтрока.тм_Сотрудник = СтрЗапас.тм_Сотрудник;	
			КонецЕсли; 
		КонецЦикла;  
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда		
		Для каждого СтрЗапас Из ЭтотОбъект.Запасы Цикл
			СтрЗапас.тм_Сотрудник = тм_КЭШ.СотрудникПользователя(ДанныеЗаполнения.Автор);	
		КонецЦикла;  						
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
